
# Parameters
nc: 4  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
 
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, TRCSP_1, [1024]],   # CSP with MHSA_layer layer
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]
 
# YOLOv5 v6.0 head
head:
  [[4, 1, Conv, [128, 1, 1]], # 10
   [6, 1, Conv, [256, 1, 1]], # 11
 
   [[10, 11], 1, ASFF_2, [128, 0]], # 12
   [[10, 11], 1, ASFF_2, [256, 1]], # 13
   [12,1,CoordAtt,[128]],
   [13,1,CoordAtt,[256]],
 
   [-2, 1, C3, [128, False]], # 16
   [-2, 1, C3, [256, False]], # 17
 
   [9, 1, TRCSP_1, [512,20,20]],
   [-1, 1, Conv, [512, 1, 1]], # 19
 
   [[16, 17, 19], 1, ASFF_3, [128, 0]], # 20
   [[16, 17, 19], 1, ASFF_3, [256, 1]], # 21
   [[16, 17, 19], 1, ASFF_3, [512, 2]], # 22
   [20,1,CoordAtt,[128]],
   [21,1,CoordAtt,[256]],
   [22,1,CoordAtt,[512]],

   # Additional weighted feature concat pathways
   [[23, 16], 1, WF_Concat, [1]],
   [[24, 17], 1, WF_Concat, [1]],
   [[25, 19], 1, WF_Concat, [1]],
   [26, 1, C3, [128, False]],
   [27, 1, C3, [256, False]],
   [28, 1, TRCSP_1, [512,20,20,False]], # CSP with MHSA_layer layer
   [[29, 30, 31], 1, Detect, [nc, anchors]]
]